app/controllers/admin/builders_controller.rb

SELECT `builders`.* FROM `builders`
---
  def index
    @builders=Builder.all

SELECT `builders`.* FROM `builders` WHERE `builders`.`id` = 1 LIMIT 1
UPDATE `builders` SET `approved` = 1, `updated_at` = '2013-10-01 10:03:17' WHERE `builders`.`id` = 1
---
  def block_builders
    @builders=Builder.find(params[:id])
    if params[:status] == 'tru'
      @builders.update_attribute(:approved,true)

SELECT `builders`.* FROM `builders` WHERE `builders`.`id` = 1 LIMIT 1
---
  def manage_properties
    @builder = Builder.find_by_id(params[:id])