app/views/properties/show.html.erb

      <td>
        <% @property.images.each do |image| %>
---
SELECT `images`.* FROM `images` WHERE `images`.`property_id` = 6