app/views/dashboards/search.html.erb

          Images:
          <% property.images.each do |image| %>
---
SELECT `images`.* FROM `images` WHERE `images`.`property_id` = 6 LIMIT 1