app/controllers/dashboards_controller.rb

  def search

    @properties = Property.property_listing(params[:property_listing]).property_type(params[:property_type]).sale_price(params[:sale_price]).city(params[:city]).paginate(:page => params[:page], :per_page => 5)
    @properties.each do|property|
    property.update_attributes(:search_view => property.search_view+1)
---
SELECT `properties`.* FROM `properties` WHERE (property_listing = 'For Rent') AND (property_type = 'Villa') AND (city = 'Hyderabad') LIMIT 5 OFFSET 0
UPDATE `properties` SET `search_view` = 1, `updated_at` = '2013-10-07 11:44:41' WHERE `properties`.`id` = 1

  def show
    @property = Property.find(params[:id])
---
SELECT `properties`.* FROM `properties` WHERE `properties`.`id` = 13 LIMIT 1