app/controllers/properties_controller.rb

  def index
    if params[:format].present?
      @builder = Builder.find_by_id(params[:format])
      @properties = @builder.properties
    else
      @properties = current_builder.properties.where("published = #{true}")
---
SELECT `builders`.* FROM `builders` WHERE `builders`.`id` IS NULL LIMIT 1
SELECT `properties`.* FROM `properties` WHERE (:builder_id == 2)

  def show

    @property = Property.find(params[:id])
    @property.update_attributes(:full_view =>@property.full_view+1)
---
SELECT `properties`.* FROM `properties` WHERE `properties`.`id` = 6 LIMIT 1
UPDATE `properties` SET `full_view` = 1, `updated_at` = '2013-10-07 12:08:39' WHERE `properties`.`id` = 1

  def new
    @builder = params[:builder_id] ? Builder.find(params[:builder_id]) : current_builder
---
SELECT `builders`.* FROM `builders` WHERE `builders`.`id` = 2 LIMIT 1

  def create
    @builder = params[:builder_id] ? Builder.find(params[:builder_id]) : current_builder
---
SELECT `builders`.* FROM `builders` WHERE `builders`.`id` = 2 LIMIT 1

      @property.end_date=""
    end

    if @property.save
---
INSERT INTO `properties` (`address`, `builder_id`, `city`, `created_at`, `description`, `end_date`, `expire_date`, `full_view`, `gmaps`, `latitude`, `longitude`, `no_of_flats`, `no_of_floors`, `no_of_houses`, `no_of_plots`, `parking`, `party_hall`, `playground`, `property_listing`, `property_name`, `property_status`, `property_type`, `published`, `sale_price`, `saleable_area`, `search_view`, `start_date`, `state`, `swimming`, `total_area`, `upcoming_date`, `updated_at`, `zip_code`) VALUES ('Airport road', 16, 'bangalore', '2013-10-08 05:29:27', 'Near at airport in bangalore', NULL, '2013-12-08', 0, 1, 12.9600332, 77.6560949, NULL, NULL, NULL, 5, 1, 0, 1, 'For Sale', 'sivpr', 'Upcoming', 'Layout', 0, '15000', '5500', 0, NULL, 'karnataka', 0, '6000', '2013-11-08', '2013-10-08 05:29:27', '515123')

  def edit
    @builder = Builder.find params[:builder_id]
    @property = Property.find(params[:id])
---
SELECT `builders`.* FROM `builders` WHERE `builders`.`id` = 2 LIMIT 1
SELECT `properties`.* FROM `properties` WHERE `properties`.`id` = 13 LIMIT 1

  def destroy
    @property = Property.find(params[:id])
---
SELECT `properties`.* FROM `properties` WHERE `properties`.`id` = 13 LIMIT 1

  def manage_property
    @properties = Property.find params[:id]
    @properties.update_attribute(:published,params[:status])
---
SELECT `properties`.* FROM `properties` WHERE `properties`.`id` = 13 LIMIT 1
UPDATE `properties` SET `published` = 1, `updated_at` = '2013-10-04 11:46:02' WHERE `properties`.`id` = 14

  def summary
    @property = Property.find(params[:id])
---
SELECT `properties`.* FROM `properties` WHERE `properties`.`id` = 1 LIMIT 1